RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/inc/hc32_ll_tmr4.h
/**
 *******************************************************************************
 * @file  hc32_ll_tmr4.h
 * @brief This file contains all the functions prototypes of the TMR4
 *        driver library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32_LL_TMR4_H__
#define __HC32_LL_TMR4_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_def.h"

#include "hc32f4xx.h"
#include "hc32f4xx_conf.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @addtogroup LL_TMR4
 * @{
 */

#if (LL_TMR4_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup TMR4_Global_Types TMR4 Global Types
 * @{
 */

/**
 * @brief TMR4 Counter function initialization configuration
 * @note The TMR4 division(u16ClockDiv) is valid when clock source is the internal clock.
 */
typedef struct {
    uint16_t u16ClockSrc;       /*!< TMR4 counter clock source.
                                     This parameter can be a value of @ref TMR4_Count_Clock_Source */
    uint16_t u16ClockDiv;       /*!< TMR4 counter internal clock division.
                                     This parameter can be a value of @ref TMR4_Count_Clock_Division. */
    uint16_t u16CountMode;      /*!< TMR4 counter mode.
                                     This parameter can be a value of @ref TMR4_Count_Mode */
    uint16_t u16PeriodValue;    /*!< TMR4 counter period value.
                                     This parameter can be a value of half-word */
} stc_tmr4_init_t;

/**
 * @brief The configuration of Output-Compare high channel(OUH/OVH/OWH)
 */
typedef union {
    uint16_t OCMRx;             /*!< OCMRxH(x=U/V/W) register */

    struct {                    /*!< OCMRxH(x=U/V/W) register struct field bit */
        uint16_t OCFDCH : 1;    /*!< OCMRxh b0 High channel's OCF status when high channel match occurs at the condition that counter is counting down
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_OCF_State */
        uint16_t OCFPKH : 1;    /*!< OCMRxh b1 High channel's OCF status when high channel match occurs at the condition that counter count=Peak
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_OCF_State */
        uint16_t OCFUCH : 1;    /*!< OCMRxh b2 High channel's OCF status when high channel match occurs at the condition that counter is counting up
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_OCF_State */
        uint16_t OCFZRH : 1;    /*!< OCMRxh b3 High channel's OCF status when high channel match occurs at the condition that counter count=0x0000
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_OCF_State */
        uint16_t OPDCH  : 2;    /*!< OCMRxh b5~b4 High channel's OP output status when high channel match occurs at the condition that counter is counting down
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint16_t OPPKH  : 2;    /*!< OCMRxh b7~b6 High channel's OP output status when high channel match occurs at the condition that counter count=Peak
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint16_t OPUCH  : 2;    /*!< OCMRxh b9~b8 High channel's OP output status when high channel match occurs at the condition that counter is counting up
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint16_t OPZRH  : 2;    /*!< OCMRxh b11~b10 High channel's OP output status when high channel match occurs at the condition that counter count=0x0000
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint16_t OPNPKH : 2;    /*!< OCMRxh b13~b12 High channel's OP output status when high channel match doesn't occur at the condition that counter count=Peak
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint16_t OPNZRH : 2;    /*!< OCMRxh b15~b14 High channel's OP output status when high channel match doesn't occur at the condition that counter count=0x0000
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
    } OCMRx_f;
} un_tmr4_oc_ocmrh_t;

/**
 * @brief The configuration of Output-Compare low channel(OUL/OVL/OWL)
 */
typedef union {
    uint32_t OCMRx;             /*!< OCMRxL(x=U/V/W) register */

    struct {                    /*!< OCMRxL(x=U/V/W) register struct field bit*/
        uint32_t OCFDCL  : 1;   /*!< OCMRxl b0 Low channel's OCF status when low channel match occurs at the condition that counter is counting down
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_OCF_State */
        uint32_t OCFPKL  : 1;   /*!< OCMRxl b1 Low channel's OCF status when low channel match occurs at the condition that counter count=Peak
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_OCF_State */
        uint32_t OCFUCL  : 1;   /*!< OCMRxl b2 Low channel's OCF status when low channel match occurs at the condition that counter is counting up
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_OCF_State */
        uint32_t OCFZRL  : 1;   /*!< OCMRxl b3 Low channel's OCF status when low channel match occurs at the condition that counter count=0x0000
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_OCF_State */
        uint32_t OPDCL   : 2;   /*!< OCMRxl b5~b4 Low channel's OP output status when high channel not match and low channel match occurs at the condition that counter is counting down
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t OPPKL   : 2;   /*!< OCMRxl b7~b6 Low channel's OP output status when high channel not match and low channel match occurs at the condition that counter count=Peak
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t OPUCL   : 2;   /*!< OCMRxl b9~b8 Low channel's OP output status when high channel not match and low channel match occurs at the condition that counter is counting up
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t OPZRL   : 2;   /*!< OCMRxl b11~b10 Low channel's OP output status when high channel not match and low channel match occurs at the condition that counter count=0x0000
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t OPNPKL  : 2;   /*!< OCMRxl b13~b12 Low channel's OP output status when high channel not match and low channel not match occurs at the condition that counter count=Peak
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t OPNZRL  : 2;   /*!< OCMRxl b15~b14 Low channel's OP output status when high channel not match and low channel not match occurs at the condition that counter count=0x0000
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t EOPNDCL : 2;   /*!< OCMRxl b17~b16 Low channel's OP output status when high channel match and low channel not match occurs at the condition that counter is coutning down
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t EOPNUCL : 2;   /*!< OCMRxl b19~b18 Low channel's OP output status when high channel match and low channel not match occurs at the condition that counter is counting up
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t EOPDCL  : 2;   /*!< OCMRxl b21~b20 Low channel's OP output status when high channel and low channel match occurs at the condition that counter is counting down
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t EOPPKL  : 2;   /*!< OCMRxl b23~b22 Low channel's OP output status when high channel and low channel match occurs at the condition that counter count=Peak
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t EOPUCL  : 2;   /*!< OCMRxl b25~b24 Low channel's OP output status when high channel and low channel match occurs at the condition that counter is counting up
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t EOPZRL  : 2;   /*!< OCMRxl b27~b26 Low channel's OP output status when high channel and low channel match occurs at the condition that counter count=0x0000
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t EOPNPKL : 2;   /*!< OCMRxl b29~b28 Low channel's OP output status when high channel match and low channel not match occurs at the condition that counter count=Peak
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
        uint32_t EOPNZRL : 2;   /*!< OCMRxl b31~b30 Low channel's OP output status when high channel match and low channel not match occurs at the condition that counter count=0x0000
                                     This parameter can be a value of @ref TMR4_OC_Count_Match_Output_Polarity */
    } OCMRx_f;
} un_tmr4_oc_ocmrl_t;

/**
 * @brief TMR4 Output-Compare(OC) initialization configuration
 */
typedef struct {
    uint16_t u16CompareValue;           /*!< TMR4 OC compare match value.
                                             This parameter can be a value of half-word. */
    uint16_t u16OcInvalidPolarity;      /*!< Port output polarity when OC is disabled.
                                             This parameter can be a value of @ref TMR4_OC_Invalid_Output_Polarity. */
    uint16_t u16CompareModeBufCond;     /*!< Register OCMR buffer transfer condition.
                                             This parameter can be a value of @ref TMR4_OC_Buffer_Transfer_Condition. */
    uint16_t u16CompareValueBufCond;    /*!< Register OCCR buffer transfer condition.
                                             This parameter can be a value of @ref TMR4_OC_Buffer_Transfer_Condition. */
    uint16_t u16BufLinkTransObject;     /*!< Enable the specified object(OCMR/OCCR) register buffer linked transfer with the counter interrupt mask.
                                             This parameter can be a value of @ref TMR4_OC_Buffer_Object. */
} stc_tmr4_oc_init_t;

/**
 * @brief TMR4 PWM initialization configuration
 * @note The clock division(u16ClockDiv) is valid when TMR4 clock source is the internal clock.
 */
typedef struct {
    uint16_t u16Mode;                   /*!< Select PWM mode
                                             This parameter can be a value of @ref TMR4_PWM_Mode */
    uint16_t u16ClockDiv;               /*!< The internal clock division of PWM timer.
                                             This parameter can be a value of @ref TMR4_PWM_Clock_Division. */
    uint16_t u16Polarity;               /*!< TMR4 PWM polarity
                                             This parameter can be a value of @ref TMR4_PWM_Polarity */
} stc_tmr4_pwm_init_t;

/**
 * @brief TMR4 Special-Event(EVT) initialization configuration
 */
typedef struct {
    uint16_t u16Mode;                   /*!< TMR4 event mode
                                             This parameter can be a value of @ref TMR4_Event_Mode */
    uint16_t u16CompareValue;           /*!< TMR4 event compare match value.
                                             This parameter can be a value of half-word */
    uint16_t u16OutputEvent;            /*!< TMR4 event output event when match count compare condition.
                                             This parameter can be a value of @ref TMR4_Event_Output_Event */
    uint16_t u16MatchCond;              /*!< Enable the specified count compare type with counter count to generate event.
                                             This parameter can be a value of @ref TMR4_Event_Match_Condition */
} stc_tmr4_evt_init_t;

/**
 * @}
 */

